{
  "state": "California",
  "slug": "california",
  "abbreviation": "CA",
  "lastUpdated": "2026-01-12",
  "source": "Ballotpedia",
  "sourceUrl": "https://ballotpedia.org/California_Constitution",
  "preamble": "We, the People of the State of California, grateful to Almighty God for our freedom, in order to secure and perpetuate its blessings, do establish this Constitution.",
  "articles": [
    {
      "number": 1,
      "title": "Declaration of Rights",
      "sections": [
        {
          "number": 1,
          "title": "Inalienable Rights",
          "text": "All people are by nature free and independent and have inalienable rights. Among these are enjoying and defending life and liberty, acquiring, possessing, and protecting property, and pursuing and obtaining safety, happiness, and privacy."
        },
        {
          "number": 1.1,
          "title": "Reproductive Freedom",
          "text": "The state shall not deny or interfere with an individual's reproductive freedom in their most intimate decisions, which includes their fundamental right to choose to have an abortion and their fundamental right to choose or refuse contraceptives. This section is intended to further the constitutional right to privacy guaranteed by Section 1, and the constitutional right to not be denied equal protection guaranteed by Section 7. Nothing herein narrows or limits the right to privacy or equal protection."
        },
        {
          "number": 2,
          "title": "Freedom of Speech and Press",
          "text": "(a) Every person may freely speak, write and publish his or her sentiments on all subjects, being responsible for the abuse of this right. A law may not restrain or abridge liberty of speech or press.\n\n(b) A publisher, editor, reporter, or other person connected with or employed upon a newspaper, magazine, or other periodical publication, or by a press association or wire service, or any person who has been so connected or employed, shall not be adjudged in contempt by a judicial, legislative, or administrative body, or any other body having the power to issue subpoenas, for refusing to disclose the source of any information procured while so connected or employed for publication in a newspaper, magazine or other periodical publication, or for refusing to disclose any unpublished information obtained or prepared in gathering, receiving or processing of information for communication to the public.\n\nNor shall a radio or television news reporter or other person connected with or employed by a radio or television station, or any person who has been so connected or employed, be so adjudged in contempt for refusing to disclose the source of any information procured while so connected or employed for news or news commentary purposes on radio or television, or for refusing to disclose any unpublished information obtained or prepared in gathering, receiving or processing of information for communication to the public.\n\nAs used in this subdivision, \"unpublished information\" includes information not disseminated to the public by the person from whom disclosure is sought, whether or not related information has been disseminated and includes, but is not limited to, all notes, outtakes, photographs, tapes or other data of whatever sort not itself disseminated to the public through a medium of communication, whether or not published information based upon or related to such material has been disseminated."
        },
        {
          "number": 3,
          "title": "Right to Assemble and Petition; Public Access",
          "text": "(a) The people have the right to instruct their representatives, petition government for redress of grievances, and assemble freely to consult for the common good.\n\n(b)\n\n(1) The people have the right of access to information concerning the conduct of the people's business, and, therefore, the meetings of public bodies and the writings of public officials and agencies shall be open to public scrutiny.\n\n(2) A statute, court rule, or other authority, including those in effect on the effective date of this subdivision, shall be broadly construed if it furthers the people's right of access, and narrowly construed if it limits the right of access. A statute, court rule, or other authority adopted after the effective date of this subdivision that limits the right of access shall be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\n(3) Nothing in this subdivision supersedes or modifies the right of privacy guaranteed by Section 1 or affects the construction of any statute, court rule, or other authority to the extent that it protects that right to privacy, including any statutory procedures governing discovery or disclosure of information concerning the official performance or professional qualifications of a peace officer.\n\n(4) Nothing in this subdivision supersedes or modifies any provision of this Constitution, including the guarantees that a person may not be deprived of life, liberty, or property without due process of law, or denied equal protection of the laws, as provided in Section 7.\n\n(5) This subdivision does not repeal or nullify, expressly or by implication, any constitutional or statutory exception to the right of access to public records or meetings of public bodies that is in effect on the effective date of this subdivision, including, but not limited to, any statute protecting the confidentiality of law enforcement and prosecution records.\n\n(6) Nothing in this subdivision repeals, nullifies, supersedes, or modifies protections for the confidentiality of proceedings and records of the Legislature, the Members of the Legislature, and its employees, committees, and caucuses provided by Section 7 of Article IV, state law, or legislative rules adopted in furtherance of those provisions; nor does it affect the scope of permitted discovery in judicial or administrative proceedings regarding deliberations of the Legislature, the Members of the Legislature, and its employees, committees, and caucuses.\n\n(7) In order to ensure public access to the meetings of public bodies and the writings of public officials and agencies, as specified in paragraph (1), each local agency is hereby required to comply with the California Public Records Act (Chapter 3.5 (commencing with Section 6250) of Division 7 of Title 1 of the Government Code) and the Ralph M. Brown Act (Chapter 9 (commencing with Section 54950) of Part 1 of Division 2 of Title 5 of the Government Code), and with any subsequent statutory enactment amending either act, enacting a successor act, or amending any successor act that contains findings demonstrating that the statutory enactment furthers the purposes of this section."
        },
        {
          "number": 4,
          "title": "Free Exercise of Religion",
          "text": "Free exercise and enjoyment of religion without discrimination or preference are guaranteed. This liberty of conscience does not excuse acts that are licentious or inconsistent with the peace or safety of the State. The Legislature shall make no law respecting an establishment of religion.\n\nA person is not incompetent to be a witness or juror because of his or her opinions on religious beliefs."
        },
        {
          "number": 5,
          "title": "Military Subordinate to Civil Power",
          "text": "The military is subordinate to civil power. A standing army may not be maintained in peacetime. Soldiers may not be quartered in any house in wartime except as prescribed by law, or in peacetime without the owner's consent."
        },
        {
          "number": 6,
          "title": "Slavery Prohibited",
          "text": "Slavery is prohibited. Involuntary servitude is prohibited except to punish crime."
        }
      ]
    }
  ]
}